android/widget.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>widget</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-29 16:15:27 CST"/>
<meta name="author" content="CrimsonFantasy"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">widget</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 SimepleAdaptor </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> SimepleAdaptor </h3>
<div class="outline-text-3" id="text-1">





<pre class="example">String[] list = {"item 0 " , "item 1" ,"item 2"}
ArrayLst&lt;Map&lt;String, Object&gt;&gt; items = new ArrayList&lt;Map&lt;String, Object&gt;&gt;();
for (int i = 0; i &lt; list.length; i++) {
      Map&lt;String, Object&gt; item = new HashMap&lt;String, Object&gt;();
      item.put("text", list[i]);
      items.add(item);
      }
SimpleAdapter = new SimpleAdapter(context, items,
      R.layout.engineerbackbar, new String[] { "text" },
      new int[] { R.id.text });

</pre>




<p>
Each item in listView  has one clumn named "text".  
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" />
</colgroup>
<tbody>
<tr><td>"text" (column name) &mdash;&mdash;&mdash;&gt; item 0</td></tr>
<tr><td>"text" (column name) &mdash;&mdash;&mdash;&gt; item 1</td></tr>
<tr><td>"text" (column name) &mdash;&mdash;&mdash;&gt; item 2</td></tr>
</tbody>
</table>

ListView has more than one item.
There is one column named "text" in item. And a View(which refer sourece R.id.text) is binded to coulmn. 




</div>
</div>
<div id="postamble">
<p class="author"> Author: CrimsonFantasy
<a href="mailto:crimsonfantasy@CrimsonFantasy.www.crimsonfantasy.com">&lt;crimsonfantasy@CrimsonFantasy.www.crimsonfantasy.com&gt;</a>
</p>
<p class="date"> Date: 2014-09-29 16:15:27 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
